app/Livewire/StudentIndex.php

    public function render()
    {


        $this->shareAnnee = session('shareYear');
        $this->shareNiveau = session('shareNiveau');


        return view('livewire.student-index', [


            'ecole'=>ecole::select('id','NOMCOMPLs')->get(),
---
select `id`, `NOMCOMPLs` from `ecoles`